In [65]:
'''
seaborn의 타이타닉 데이터를 불러오자
'''

'\nseaborn의 타이타닉 데이터를 불러오자\n'

In [66]:
import seaborn as sns
df = sns.load_dataset('titanic')

In [67]:
'''
테이터프레임 구조 확인
'''

'\n테이터프레임 구조 확인\n'

In [68]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [69]:
'''
이때 info()를 통해 어느 데이터에 누락 데이터가 많은지를 확인하자.
문제가 있는지 확인을 해야한다.
그 열이 가진 고유값을 확인해 보자.
value_counts로 확인을 하자. 이때 NaN을 포함시켜야한다.
'''

'\n이때 info()를 통해 어느 데이터에 누락 데이터가 많은지를 확인하자.\n문제가 있는지 확인을 해야한다.\n그 열이 가진 고유값을 확인해 보자.\nvalue_counts로 확인을 하자. 이때 NaN을 포함시켜야한다.\n'

In [70]:
for col in df.columns:
    print(f'< column : {col} >')
    print(df[col].value_counts())
    print('-'*30)

< column : survived >
0    549
1    342
Name: survived, dtype: int64
------------------------------
< column : pclass >
3    491
1    216
2    184
Name: pclass, dtype: int64
------------------------------
< column : sex >
male      577
female    314
Name: sex, dtype: int64
------------------------------
< column : age >
24.00    30
22.00    27
18.00    26
28.00    25
19.00    25
         ..
55.50     1
74.00     1
0.92      1
70.50     1
12.00     1
Name: age, Length: 88, dtype: int64
------------------------------
< column : sibsp >
0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: sibsp, dtype: int64
------------------------------
< column : parch >
0    678
1    118
2     80
3      5
5      5
4      4
6      1
Name: parch, dtype: int64
------------------------------
< column : fare >
8.0500     43
13.0000    42
7.8958     38
7.7500     34
26.0000    31
           ..
50.4958     1
13.8583     1
8.4583      1
7.7250      1
7.5208      1
Name: fare, Length: 248, dtype: int64
------------------------------
< column : embarked >
S    644
C    168
Q     77
Name: embarked, dtype: int64
------------------------------
< column : class >
Third     491
First     216
Second    184
Name: class, dtype: int64
------------------------------
< column : who >
man      537
woman    271
child     83
Name: who, dtype: int64
------------------------------
< column : adult_male >
True     537
False    354
Name: adult_male, dtype: int64
------------------------------
< column : deck >
C    59
B    47
D    33
E    32
A    15
F    13
G     4
Name: deck, dtype: int64
------------------------------
< column : embark_town >
Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64
------------------------------
< column : alive >
no     549
yes    342
Name: alive, dtype: int64
------------------------------
< column : alone >
True     537
False    354
Name: alone, dtype: int64
------------------------------

In [71]:
# 1단계_누락 데이터 처리
'''
for 반복문으로 각 열의 NaN 개수 계산하기
'''

'\nfor 반복문으로 각 열의 NaN 개수 계산하기\n'

In [72]:
print('column별 null의 개수 정리')
for col in df.columns:
    try: 
        null_num = df[col].isnull().value_counts()[True]
    except: 
        null_num = 0
    
    print(f'{col:<12s} : {null_num:>4d} 개')

column별 null의 개수 정리
survived     :    0 개
pclass       :    0 개
sex          :    0 개
age          :  177 개
sibsp        :    0 개
parch        :    0 개
fare         :    0 개
embarked     :    2 개
class        :    0 개
who          :    0 개
adult_male   :    0 개
deck         :  688 개
embark_town  :    2 개
alive        :    0 개
alone        :    0 개

In [73]:
# 2단계_누락 데이터 제거
'''
# NaN 값이 500개 이상인 열을 모두 삭제
'''

'\n# NaN 값이 500개 이상인 열을 모두 삭제\n'

In [74]:
df2 = df.dropna(thresh=500, axis=1)
print('before shape >', df.shape)
print('after shape >', df2.shape)

before shape > (891, 15)
after shape > (891, 14)

In [75]:
'''
# age 열에 나이 데이터가 없는 모든 행을 삭제 
'''

'\n# age 열에 나이 데이터가 없는 모든 행을 삭제 \n'

In [76]:
df3 = df2.dropna(subset=['age'])
print('before shape >', df2.shape)
print('after shape >', df3.shape)

before shape > (891, 14)
after shape > (714, 14)

In [77]:
# 2단계_누락 데이터 치환
'''
age 열의 첫 10개 데이터 출력 (5 행에 NaN 값)
'''

'\nage 열의 첫 10개 데이터 출력 (5 행에 NaN 값)\n'

In [78]:
df2['age'].head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

In [79]:
'''
age 열의 NaN값을 다른 나이 데이터의 평균으로 변경하기
+ 중간값으로 변경해보기
+ 최빈값으로 변경해보기
'''

'\nage 열의 NaN값을 다른 나이 데이터의 평균으로 변경하기\n+ 중간값으로 변경해보기\n+ 최빈값으로 변경해보기\n'

In [80]:
mean_age = df2['age'].mean(axis=0)
median_age = df2['age'].median(axis=0)
freq_age = df2['age'].value_counts(dropna=True).idxmax()
print('mean of age :', mean_age)
print('median of age :', median_age)
print('most freq of age :', freq_age)
print()

df2_age_mean = df2['age'].fillna(mean_age)
df2_age_median = df2['age'].fillna(median_age)
df2_age_freq = df2['age'].fillna(freq_age)

print(df2_age_mean.head(10))
print()
print(df2_age_median.head(10))
print()
print(df2_age_freq.head(10))

df3 = df2.copy()
df3['age'] = df2_age_mean

mean of age : 29.69911764705882
median of age : 28.0
most freq of age : 24.0

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: age, dtype: float64

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5    28.0
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5    24.0
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

In [81]:
'''
CASE 1 
embark_town 열의 829행의 NaN 데이터 출력
'''

'\nCASE 1 \nembark_town 열의 829행의 NaN 데이터 출력\n'

In [82]:
df3['embark_town'].iloc[829]

nan

In [83]:
'''
embark_town 열의 NaN값을 승선도시 중에서 가장 많이 출현한 값으로 치환하기
'''

'\nembark_town 열의 NaN값을 승선도시 중에서 가장 많이 출현한 값으로 치환하기\n'

In [84]:
df_tmp = df3['embark_town']
freq_town = df_tmp.value_counts(dropna=True).idxmax()

print('most freq of town :', freq_town)

df_tmp.fillna(freq_town, inplace=True)

df4 = df3.copy()
df4['embark_twon'] = df_tmp

print('Done!')

most freq of town : Southampton
Done!
Southampton

In [85]:
'''
embark_town 열 829행의 NaN 데이터 출력 (NaN 값이 most_freq 값으로 대체)
'''

'\nembark_town 열 829행의 NaN 데이터 출력 (NaN 값이 most_freq 값으로 대체)\n'

In [93]:
print(df4['embark_town'].iloc[829])

Southampton

In [86]:
'''
CASE 2
embark_town 열의 NaN값을 바로 앞에 있는 828행의 값으로 변경하기
'''

'\nCASE 2\nembark_town 열의 NaN값을 바로 앞에 있는 828행의 값으로 변경하기\n'

In [87]:
'''
age 열의 첫 10개 데이터 출력 (5 행에 NaN 값이 평균으로 대체)

'''

'\nage 열의 첫 10개 데이터 출력 (5 행에 NaN 값이 평균으로 대체)\n\n'

## 실습

In [88]:
# 라이브러리 불러오기
import pandas as pd

# 중복 데이터를 갖는 데이터프레임 만들기
df = pd.DataFrame({'c1':['a', 'a', 'b', 'a', 'b'],
                  'c2':[1, 1, 1, 2, 2],
                  'c3':[1, 1, 2, 2, 2]})

In [95]:
'''
데이터프레임 전체 행 데이터 중에서 중복값 찾기
'''

print(df)
print()
print(df.duplicated())

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [100]:
'''
데이터프레임의 특정 열 데이터에서 중복값 찾기
'''

print(df['c1'])
print()
print(df['c1'].duplicated())

print()
print(df.duplicated(subset=['c1']))

0    a
1    a
2    b
3    a
4    b
Name: c1, dtype: object

0    False
1     True
2    False
3     True
4     True
Name: c1, dtype: bool

0    False
1     True
2    False
3     True
4     True
dtype: bool

In [98]:
'''
데이터프레임에서 중복 행을 제거
'''

df_dup = df.duplicated()
df_new = df[df_dup == False]
print(df_new)

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [102]:
'''
c2, c3열을 기준으로 중복 행을 제거
'''

df_dup2 = df.duplicated(subset=['c2','c3'])
df_new2 = df[df_dup2 == False]

print(df)
print()
print(df_new2)

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2